# Improved Teacher Model Based on YOLO12n (YOLO12n-ITM)
# Parameters
nc: 3
scales: 
  n: [0.50, 0.25, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, PSConv,  [64, 3, 2]] # 0
  - [-1, 1, PSConv,  [128, 3, 2]] # 1
  - [-1, 2, C3k2_MSE,[256, False, 0.25]]
  - [-1, 1, PSConv,  [256, 3, 2]] # 3
  - [-1, 2, C3k2_MSE,[512, False, 0.25]]
  - [-1, 1, Conv,  [512, 3, 2]] # 5
  - [-1, 4, A2C2f, [512, True, 4]]
  - [-1, 1, Conv,  [1024, 3, 2]] # 7
  - [-1, 4, A2C2f, [1024, True, 1]] # 8

head:
  - [-1, 1, EUCB, []]
  - [[-1, 6], 1, Concat, [1]] 
  - [-1, 2, A2C2f, [512, False, -1]] # 11

  - [-1, 1, EUCB, []]
  - [[-1, 4], 1, Concat, [1]] 
  - [-1, 2, A2C2f, [256, False, -1]] # 14

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 11], 1, Concat, [1]] 
  - [-1, 2, A2C2f, [512, False, -1]] # 17

  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 8], 1, Concat, [1]] 
  - [-1, 2, C3k2, [1024,True]] # 20

  - [[14, 17, 20], 1, EDH, [nc]] 